---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ValidationStatus
source: html/9d208301-607f-45b0-d5af-e20b2e6a92ed.htm
---
# Autodesk.Revit.DB.FabricationPart.ValidationStatus Property

The validation status of the fabrication part.

## Syntax (C#)
```csharp
public ValidationStatus ValidationStatus { get; }
```